1 -
     first thing add in code is: #include<iostream> std
    //                                            ============================================
2 -
   علشان اعمل مسافات في السطر بستخدم شويه رموز زي \n سطر جديد   \t نفس السطر بس مسافه 8حروف   \r  \a  \\ \'اقبتياس بعلامه واحده \''اقتباس بعلامتين
    //                                            ============================================
3 -
   c++ data taypes:charحرف - int ارقام بدون كسور - short - bool - float كسور - doubleكسور طويله  - longdouble
    //                                            ============================================
4 -
   all variables must be initalized but not nessery declaration.4 - int = 4bytes -- -short = 2bytes -- -double = 8types -- -char = حرف-- - unsigned = 4bytes only possitive-- - float = 4bytes
    //                                            ============================================
5 -
   المعادلات اللي فيها اكتر من data types have some roles : والقوانين للمعادلات كلها برضو
   
    a -
    int + int + int + int.....int = int
    b -
    float + double = double
    c -
    int + float + double = double
    d -
    بالبلدي هيكون الناتج هوا النوع الكبير
    e -
    لو بتخزن قيمه جوا قيمه هيتحفظ الرقم الصحيح فقط
    f -
    (++)(--)القيم دي بتستخدم لو هنزود او نقلل واحد بس بتكون قبل او بعد المعادله لو اتحطت قبل هيتم حسابها وبعدين اكمال المعادله والعكس لو بعد تحسب المعادله وبعدين تكمل
    g -
    (+=)(-=)(*=)(/=)(%=) القيم دي اسمها سبيشيال اسيمنتت ستيتمنت
    h -
    ترتيب العمليات الحسابيه كدا = >
                                        () * / % +-
   
    //                                            ============================================
6 -
   
    ==يساوي
    != لا يساوي
    <اكبر من
    >اصغر من
    <=اكمر من او يساوي
    >= اصغر من او يساوي
   
